# GetLengthUnitTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementRoundingManager..::..GetLengthUnitTypeId Method
ReinforcementRoundingManager Class See Also
---
Gets the identifier of the length unit quantifying the reinforcement rounding values.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ForgeTypeId GetLengthUnitTypeId()
```

Visual Basic
---
```text
Public Function GetLengthUnitTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetLengthUnitTypeId()
```

# See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace